Revit 2023 API
AreaReinforcement.AreaReinforcementType Property
 Retrieves the type of the Area Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public AreaReinforcementType AreaReinforcementType { get; }
Visual Basic
Public ReadOnly Property AreaReinforcementType As AreaReinforcementType
	Get
Visual C++
public:
property AreaReinforcementType^ AreaReinforcementType {
	AreaReinforcementType^ get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace